<?php
defined('BASEPATH') OR exit('No direct script access allowed');

class Mail extends CI_Controller {
    public $template = array();
    
    public function __construct(){
        parent::__construct();
        // $this->load->model('Mail_model');
        $this->template['details'] = "เรียน  %projectLeader% ".br(2)."
                                ".nbs(10)."ตามที่โครงการวิจัยของท่าน (%projectCode%) ได้รับอนุมัติ / การขยายเวลารับรองโครงการ
                                ด้านความปลอดภัยทางชีวภาพ ไปเมื่อวันที่ 25 มกราคม 2565 นั้น".br(2)."

                                ".nbs(10)."บัดนี้ใกล้ครบกำหนดรายงานความก้าวหน้า 12 เดือน ในวันที่ 24 มกราคม 2566 คณะกรรมการฯ 
                                จึงขอให้ท่านดำเนินการ จัดทำแบบฟอร์ม TU-IBC_E ดังนี้".br()."
                                1. โครงการวิจัยเสร็จสิ้น แจ้งปิดโครงการ".br()."
                                2. โครงการวิจัยอยู่ระหว่างดำเนินการ รายงานความก้าวหน้าพร้อมขอขยายระยะเวลา".br(2)."

                                    ทั้งนี้ท่านสามารถถดาวโหลดแบบฟอร์ม TU-IBC_E  ได้ที่  
                                ลิ้งก์ <a href = 'https://research.tu.ac.th/process-biosafety'>https://research.tu.ac.th/process-biosafety</a>  ส่งมายังคณะกรรมการควบคุมความปลอดภัยทางชีวภาพ มธ. งานวางแผนและบริหารงานวิจัย อาคารสำนักงานอธิการบดี ชั้น 2 มหาวิทยาลัยธรรมศาสตร์ ศูนย์รังสิต ".br(2)."

                                ขอบพระคุณค่ะ ".br(2)."

                                ขออภัยหากท่านได้ดำเนินการจัดทำแบบฟอร์ม TU-IBC_E มาแล้ว เนื่องจากเป็นการตั้งระบบแจ้งเตือนล่วงหน้า ".br(2)."
                                        
                                ผู้ประสานงาน คณะแพทยศาสตร์ ".br()."
                                งานบริหารการวิจัย  ".br()."
                                อาคารคุณากร ชั้น 8 ".br()."
                                มหาวิทยาลัยธรรมศาสตร์ ศูนย์รังสิต ".br()."
                                โทร. 0-2926-9820, 9830 
                                ";                                          
        

    }

	public function index()
	{
        echo $this->template['details'];
	}
}